zephyrproject-rtos/zephyr/drivers/usb_c/tcpc/ucpd_stm32.c
			/*
			 * Don't pass GoodCRC control messages to the TCPM
			 * layer. In addition, need to filter for SOP'/SOP''
			 * packets if those are not enabled. SOP'/SOP''
			 * reception is controlled by a static variable. The
			 * hardware orderset detection pattern can't be changed
			 * without disabling the ucpd peripheral.
			 */
			if (!good_crc &&
			    (data->ucpd_rx_sop_prime_enabled || type == PD_PACKET_SOP)) {

				/*
				 * If BIST test mode is active, then still need
				 * to send GoodCRC reply, but there is no need
				 * to send the message up to the tcpm layer.
				 */
				if (!data->ucpd_rx_bist_mode) {
					atomic_set_bit(&info->evt, UCPD_EVT_RX_MSG);
				}
				/* Send GoodCRC message (if required) */
				ucpd_send_good_crc(dev, rx_header);
			} else if (good_crc) {
				atomic_set_bit(&info->evt, UCPD_EVT_RX_GOOD_CRC);
				data->ucpd_crc_id = rx_header.message_id;
			}
		} else {
			/* Rx message is complete, but there were bit errors */
			LOG_ERR("ucpd: rx message error");
		}

		/*
		 * UCPD_EVT_RX_MSG is set only for messages passed to the TCPM
		 * layer. If it is not set, discard the buffer so its stale
		 * bytes are not reported as a pending message.
		 */
		if (!atomic_test_bit(&info->evt, UCPD_EVT_RX_MSG)) {
			*(uint32_t *)data->ucpd_rx_buffer = 0;
		}
	}
	/* Check for fault conditions */
	if (sr & UCPD_SR_RXHRSTDET) {
		/* hard reset received */
		atomic_set_bit(&info->evt, UCPD_EVT_HARD_RESET_RECEIVED);
	}

	/* Clear interrupts now that PD events have been set */
	stm32_reg_write(&config->ucpd_port->ICR, sr & UCPD_ICR_ALL_INT_MASK);

	/* Notify application of events */
	k_work_submit(&info->work);
}

/**
 * @brief Dump a set of TCPC registers
 *
 * @retval 0 on success
 * @retval -EIO on failure
 */
static int ucpd_dump_std_reg(const struct device *dev)
{
	const struct tcpc_config *const config = dev->config;

	LOG_INF("CFGR1: %08x", stm32_reg_read(&config->ucpd_port->CFG1));
	LOG_INF("CFGR2: %08x", stm32_reg_read(&config->ucpd_port->CFG2));
	LOG_INF("CR:    %08x", stm32_reg_read(&config->ucpd_port->CR));
	LOG_INF("IMR:   %08x", stm32_reg_read(&config->ucpd_port->IMR));
	LOG_INF("SR:    %08x", stm32_reg_read(&config->ucpd_port->SR));
	LOG_INF("ICR:   %08x\n", stm32_reg_read(&config->ucpd_port->ICR));

	return 0;
}

/**
 * @brief Sets the alert function that's called when an interrupt is triggered
 *        due to a TCPC alert
 *
 * @retval 0 on success
 * @retval -EINVAL on failure
 */
static int ucpd_set_alert_handler_cb(const struct device *dev, tcpc_alert_handler_cb_t handler,
				     void *alert_data)
{
	struct tcpc_data *data = dev->data;

	data->alert_info.handler = handler;
	data->alert_info.data = alert_data;

	return 0;
}

/**
 * @brief Sets a callback that can enable or disable VCONN if the TCPC is
 *        unable to or the system is configured in a way that does not use
 *        the VCONN control capabilities of the TCPC
 *
 */
static void ucpd_set_vconn_cb(const struct device *dev, tcpc_vconn_control_cb_t vconn_cb,
			      const struct device *usbc_dev)
{
	struct tcpc_data *data = dev->data;

	data->vconn_cb = vconn_cb;
	data->usbc_dev = usbc_dev;
}

/**
 * @brief Sets a callback that can discharge VCONN if the TCPC is
 *        unable to or the system is configured in a way that does not use
 *        the VCONN discharge capabilities of the TCPC
 *
 */
static void ucpd_set_vconn_discharge_cb(const struct device *dev, tcpc_vconn_discharge_cb_t cb,
					const struct device *usbc_dev)
{
	struct tcpc_data *data = dev->data;

	data->vconn_discharge_cb = cb;
	data->usbc_dev = usbc_dev;
}

/**
 * @brief UCPD interrupt init
 */
static void ucpd_isr_init(const struct device *dev)
{
	const struct tcpc_config *const config = dev->config;
	struct tcpc_data *data = dev->data;
	struct alert_info *info = &data->alert_info;

	/* Init GoodCRC Receive timer */
	k_timer_init(&data->goodcrc_rx_timer, NULL, NULL);

	/* Disable all alert bits */
	stm32_reg_write(&config->ucpd_port->IMR, 0);

	/* Clear all alert handler */
	ucpd_set_alert_handler_cb(dev, NULL, NULL);

	/* Save device structure for use in the alert handlers */
	info->dev = dev;

	/* Initialize the work handler */
	k_work_init(&info->work, ucpd_alert_handler);

	/* Configure CC change alerts */
	stm32_reg_write(&config->ucpd_port->IMR, UCPD_IMR_TYPECEVT1IE | UCPD_IMR_TYPECEVT2IE);
	stm32_reg_write(&config->ucpd_port->ICR, UCPD_ICR_TYPECEVT1CF | UCPD_ICR_TYPECEVT2CF);

	/* SOP'/SOP'' must be enabled via TCPCI call */
	data->ucpd_rx_sop_prime_enabled = false;

	stm32_ucpd_state_init(dev);

	/* Configure and enable the IRQ */
	config_tcpc_irq();
}

/**
 * @brief Initializes the TCPC
 *
 * @retval 0 on success
 * @retval -EIO on failure
 */
static int ucpd_init(const struct device *dev)
{
	const struct device *const rcc = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct tcpc_config *const config = dev->config;
	struct tcpc_data *data = dev->data;
	uint32_t cfg1;
	int ret;

	LOG_DBG("Pinctrl signals configuration");
	ret = pinctrl_apply_state(config->ucpd_pcfg, PINCTRL_STATE_DEFAULT);
	if (ret != 0) {
		LOG_ERR("USB pinctrl setup failed (%d)", ret);
		return ret;
	}

	ret = clock_control_on(rcc, (clock_control_subsys_t *)&config->pclken);
	if (ret != 0) {
		LOG_ERR("UCPD clock enable failed (%d)", ret);
		return ret;
	}

	/* Disable the UCPD port before configuration */
	LL_UCPD_Disable(config->ucpd_port);
	LL_UCPD_SetPSCClk(config->ucpd_port,
		config->ucpd_clk_prescaler << UCPD_CFG1_PSC_UCPDCLK_Pos);
	LL_UCPD_SetTransWin(config->ucpd_port, config->transition_window);
	LL_UCPD_SetIfrGap(config->ucpd_port, config->interframe_gap);
	LL_UCPD_SetHbitClockDiv(config->ucpd_port, config->halfbit_clock_div);

	/* Init Rp to USB */
	data->rp = TC_RP_USB;

	/*
	 * Set RXORDSETEN field to control which types of ordered sets the PD
	 * receiver must receive.
	 */
	cfg1 = stm32_reg_read(&config->ucpd_port->CFG1);
	cfg1 |= LL_UCPD_ORDERSET_SOP | LL_UCPD_ORDERSET_SOP1 | LL_UCPD_ORDERSET_SOP2 |
		LL_UCPD_ORDERSET_HARDRST;
	stm32_reg_write(&config->ucpd_port->CFG1, cfg1);

	/* Enable UCPD port */
	LL_UCPD_Enable(config->ucpd_port);

