zephyrproject-rtos/zephyr/drivers/usb_c/tcpc/ucpd_stm32.c
	/* Enable Dead Battery Support */
	if (config->ucpd_dead_battery) {
		dead_battery(dev, true);
	} else {
		/*
		 * Some devices have dead battery enabled by default
		 * after power up, so disable it
		 */
		dead_battery(dev, false);
	}

	/* Initialize the isr */
	ucpd_isr_init(dev);

	return 0;
}

static DEVICE_API(tcpc, driver_api) = {
	.init = ucpd_init,
	.set_alert_handler_cb = ucpd_set_alert_handler_cb,
	.get_cc = ucpd_get_cc,
	.set_rx_enable = ucpd_set_rx_enable,
	.get_rx_pending_msg = ucpd_get_rx_pending_msg,
	.transmit_data = ucpd_transmit_data,
	.select_rp_value = ucpd_select_rp_value,
	.get_rp_value = ucpd_get_rp_value,
	.set_cc = ucpd_set_cc,
	.set_roles = ucpd_set_roles,
	.set_vconn_cb = ucpd_set_vconn_cb,
	.set_vconn_discharge_cb = ucpd_set_vconn_discharge_cb,
	.set_vconn = ucpd_set_vconn,
	.vconn_discharge = ucpd_vconn_discharge,
	.set_cc_polarity = ucpd_cc_set_polarity,
	.dump_std_reg = ucpd_dump_std_reg,
	.set_bist_test_mode = ucpd_set_bist_test_mode,
	.sop_prime_enable = ucpd_sop_prime_enable,
	.dead_battery_enabled = ucpd_dead_battery_enabled,
};

#define DEV_INST_INIT(n) dev_inst[n] = DEVICE_DT_INST_GET(n);
static void config_tcpc_irq(void)
{
	static int inst_num;
	static const struct device *dev_inst[DT_NUM_INST_STATUS_OKAY(DT_DRV_COMPAT)];

	/* Initialize and enable shared irq on last instance */
	if (++inst_num == DT_NUM_INST_STATUS_OKAY(DT_DRV_COMPAT)) {
		DT_INST_FOREACH_STATUS_OKAY(DEV_INST_INIT)

		IRQ_CONNECT(DT_INST_IRQN(0), DT_INST_IRQ(0, priority), ucpd_isr, dev_inst, 0);

		irq_enable(DT_INST_IRQN(0));
	}
}

#define TCPC_DRIVER_INIT(inst)                                                                     \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
	static struct tcpc_data drv_data_##inst;                                                   \
	static const struct tcpc_config drv_config_##inst = {                                      \
		.ucpd_pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                 \
		.ucpd_port = (UCPD_TypeDef *)DT_INST_REG_ADDR(inst),                               \
		.pclken = STM32_DT_INST_CLOCKS(inst),                                              \
		.ucpd_clk_prescaler = ilog2(DT_INST_PROP(inst, psc_ucpdclk)),                      \
		.transition_window = DT_INST_PROP(inst, transwin) - 1,                             \
		.interframe_gap = DT_INST_PROP(inst, ifrgap) - 1,                                  \
		.halfbit_clock_div = DT_INST_PROP(inst, hbitclkdiv) - 1,                           \
		.ucpd_dead_battery = DT_INST_PROP(inst, dead_battery),                             \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(inst, &ucpd_init, NULL, &drv_data_##inst, &drv_config_##inst,        \
			      POST_KERNEL, CONFIG_USBC_TCPC_INIT_PRIORITY, &driver_api);

DT_INST_FOREACH_STATUS_OKAY(TCPC_DRIVER_INIT)
